package lesson26_time.task6_testing;

public class Main {
   // 1. Создать класс Студент
   // 2. У студента должны быть характеристики: ID, имя, возраст, учебная степень(ENUM)
   // 3. Создать класс СтудентСервис, где хранится список студентов и все методы
   // 4. Список студентов в сервисе должен хранится в виде Map, где ключ - ID студента
   // 5. При создании студента не должно быть возможности присвоить ему ID
   // 6. При создании студент должен добавляться в список студентов
   // 7. Методы сервиса:
   //          А. Возвращать список всех студентов
   //          Б. Возвращать количество студентов
   //          В. Возвращать количество студентов конкретной учебной степени
   //          Г. Возвращать средний возраст всех студентов
   //          Д. Возвращать средний возраст студентов конкретной учебной степени
   //          Е. Возвращать список студентов конкретной учебной степени
   // 8. Напишите модульные тесты для методов сервиса
}
